In [133]:
### 177. Nth Highest Salary

import pandas as pd

data = [[1, 100], [2, 200], [3, 300]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'Int64', 'salary':'Int64'})

In [134]:
def nth_highest_salary(employee: pd.DataFrame, N: int) -> pd.DataFrame:
    '''
    Требуется вернуть N-е по величине максимальное уникальное значение.
    '''
    if employee['salary'].drop_duplicates().count() < N or N <= 0:
        return pd.DataFrame({f'getNthHighestSalary({N})': [pd.NA]})
    else:
        salary_unique = employee.sort_values(by='salary').drop_duplicates(subset='salary')
        return pd.DataFrame({f'getNthHighestSalary({N})': [salary_unique.iloc[-N]['salary']]})

In [135]:
nth_highest_salary(employee, 1)

   getNthHighestSalary(1)
0                     300

In [136]:
nth_highest_salary(employee, -1)

  getNthHighestSalary(-1)
0                    <NA>

In [137]:
nth_highest_salary(employee, 0)

  getNthHighestSalary(0)
0                   <NA>

In [138]:
nth_highest_salary(employee, 4)

  getNthHighestSalary(4)
0                   <NA>

In [140]:
nth_highest_salary(employee, 2)

   getNthHighestSalary(2)
0                     200

In [141]:
nth_highest_salary(employee, 3)

   getNthHighestSalary(3)
0                     100